In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv("BoxOffice Dataset.csv")

In [4]:
data.head()

,Unnamed: 0,SN,Movie,Worldwide,India Net,India Gross,Overseas,Budget,Verdict
0,0,1,Pathaan,10500000000,5240000000,6570000000,3920000000,2500000000,All Time Blockbuster
1,1,2,Baahubali 2 The Conclusion,17880000000,5100000000,14160000000,3710000000,2500000000,All Time Blockbuster
2,2,3,KGF Chapter 2,12080000000,4350000000,10000000000,2070000000,1000000000,All Time Blockbuster
3,3,4,Dangal,20700000000,3740000000,5350000000,15350000000,700000000,All Time Blockbuster
4,4,5,Sanju,5880000000,3420000000,4380000000,1500000000,1000000000,All Time Blockbuster

#### Here column name 'Unnamed' and 'SN' have no importamce, so we have to remove those columns.

In [5]:
data.drop('Unnamed: 0',axis=1,inplace=True) 
data.drop('SN',axis=1,inplace=True)

In [6]:
data.head()

,Movie,Worldwide,India Net,India Gross,Overseas,Budget,Verdict
0,Pathaan,10500000000,5240000000,6570000000,3920000000,2500000000,All Time Blockbuster
1,Baahubali 2 The Conclusion,17880000000,5100000000,14160000000,3710000000,2500000000,All Time Blockbuster
2,KGF Chapter 2,12080000000,4350000000,10000000000,2070000000,1000000000,All Time Blockbuster
3,Dangal,20700000000,3740000000,5350000000,15350000000,700000000,All Time Blockbuster
4,Sanju,5880000000,3420000000,4380000000,1500000000,1000000000,All Time Blockbuster

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Movie        1000 non-null   object
 1   Worldwide    1000 non-null   int64
 2   India Net    1000 non-null   int64
 3   India Gross  1000 non-null   int64
 4   Overseas     1000 non-null   int64
 5   Budget       1000 non-null   int64
 6   Verdict      1000 non-null   object
dtypes: int64(5), object(2)
memory usage: 54.8+ KB

In [8]:
data.isnull().sum()

Movie          0
Worldwide      0
India Net      0
India Gross    0
Overseas       0
Budget         0
Verdict        0
dtype: int64

In [9]:
data.describe()

          Worldwide     India Net   India Gross      Overseas        Budget
count  1.000000e+03  1.000000e+03  1.000000e+03  1.000000e+03  1.000000e+03
mean   1.832870e+09  4.079600e+08  6.126900e+08  9.714300e+08  5.889000e+08
std    1.049006e+10  5.783055e+08  9.814085e+08  8.596981e+09  2.101992e+09
min    0.000000e+00  2.000000e+07  0.000000e+00  0.000000e+00  0.000000e+00
25%    1.600000e+08  9.000000e+07  1.400000e+08  1.000000e+07  8.000000e+07
50%    3.700000e+08  2.000000e+08  3.100000e+08  5.000000e+07  2.000000e+08
75%    9.025000e+08  4.600000e+08  6.825000e+08  1.500000e+08  4.000000e+08
max    1.897000e+11  5.240000e+09  1.416000e+10  1.690200e+11  3.200000e+10

### The most profitable movie in the global market